---
kind: other
id: Properties.T:Autodesk.Revit.DB.BooleanOperationsUtils
source: html/2386e73f-3aec-d904-4c39-d5484ccb471d.htm
---
# BooleanOperationsUtils Properties

Specifies whether the .NET object represents a valid Revit entity.